list = ['Google', 'Runoob', 1997, 2000]
print("列表的内容为：",list)
print("第三个元素为：", list[2])
list[2] = 2001
print("修改元素操作: list[2] = 2001")
print("更新后的第三个元素为：",list[2])
print("更新后的列表为：",list)

print("*************************************************")
print("删除元素操作: del list[2]")
del list[2]
print("删除第三个元素后的列表为：",list)

print("***************04.列表脚本操作符***************")
print("组合与重复列表和字符串操作类似，用+和*号")
print("len([1,2,3]) 的执行结果为：",len([1,2,3]))
print("[1, 2, 3] + [4, 5, 6] 的执行结果为：",[1, 2, 3] + [4, 5, 6])
print("['Hi!'] * 4 的执行结果为：",['Hi!'] * 4)
print("3 in [1, 2, 3] 的执行结果为：",3 in [1, 2, 3])
print("for x in [1, 2, 3]: print(x, end=' ') 的执行结果为：")
for x in [1, 2, 3]: print(x, end=" ")

print("***************05.列表截取与拼接***************")
